

# this is a org file to test `windancer`, which is
# a parser and render
:properties:
:author: foo
:key: value
:end:
#+title: test
#+macro: color @@html:<span style="color:$1">$2</span>@@ @@latex:\textcolor{$1}{$2}@@
#+date: [2025-08-02 Sat 18:43]
#+OPTIONS: toc:nil
#+project: windancer
#+author: cnglen
#+author: contributor
#+email: cnglen@gmail.com
#+caption: a *bold* text
#+SETUPFILE: ~/.emacs.d/local/theme-readtheorg.setup
#+SETUPFILE: ~/.emacs.d/local/org-latex-cn.setup
#+macro: color @@html:<span style="color:$1">$2</span>@@@@latex:\textcolor{$1}{$2}@@
#+macro: bgcolor @@html:<span style="background-color:$1;">$2</span>@@@@latex:$2@@
#+latex_class: article
#+OPTIONS: H:4
#+HTML_HEAD: <style>pre.src{background:#282a36;color:#ffb86c;} </style>
#+render: nil

Zero-th Section: this is a */_bold-italic-underline_/*

** table test

#+CAPTION[object in table]: table with objects
#+attr_html: :border 2 :rules all :frame border
| object kind           | object value                     | supported in table cell |
|-----------------------+----------------------------------+-------------------------|
| 01 text markup        | *bold*                           | y                       |
| 02 entity             | \alpha                           | y                       |
| 03 latex fragment     | $\sum_{i=1}^{n} i$               | y                       |
| 04 superscript        | a_1                              | y                       |
| 05 subscript          | c^{2}                            | y                       |
| 06 plain text         | just text                        | y                       |
| 07 footnote-reference | [fn:1]                           | y                       |
| 08 line-break         | \\                               | n                       |
| 09 timestamp          | <1234-07-31>                     | y                       |
| 10 macro              | {{{title}}}                      | y                       |
| 11 radio-target       | <<<radio target 011>>>           | y                       |
| 12 target             | <<target 012>>                   | y                       |
| 13 plain link         | https://foo.bar                  | y                       |
| 14 angle link         | <mailto:foo@bar>                 | y                       |
| 15 radio link         | radio target 011                 | y                       |
| 16 regular link       | [[target 012]]                       | y                       |
| 17 statistics-cookie  | NA                               | n                       |
| 18 inline-babel-call  | NA                               | n                       |
| 19 inline-src-block   | NA                               | n                       |
| 20 citation           | [cite:@key]                      | y                       |
| 21 export-snippet     | @@html:<b>@@bold text@@html:</b> | y                       |
| 22 table-cell         | NA                               | n                       |
| 23 citation-reference | NA                               | n                       |


#+CAPTION: table
| Name       | Phone | Age | as  |
| /          | <r10> | <l> | <c> |
|------------+-------+-----+-----|
| Peter Jack |   123 | 2   |  4  |
| Anna       | 54321 | 125 | 999 |

#+CAPTION: table with formula
| N | N^2 | N^3 | N^4 | sqrt(n) | sqrt[4](N) |
|---+-----+-----+-----+---------+------------|
| / |   < |     |   > |       < |          > |
| 1 |   1 |   1 |   1 |       1 |          1 |
| 2 |   4 |   8 |  16 |  1.4142 |     1.1892 |
| 3 |   9 |  27 |  81 |  1.7321 |     1.3161 |
#+TBLFM: $2=$1^2::$3=$1^3::$4=$1^4::$5=sqrt($1)::$6=sqrt(sqrt(($1)))

#+CAPTION: table with formulas
|   | x |    z |
|---+---+------|
| ! | x |   z1 |
| # | 1 |  300 |
| # | 6 | 1800 |
| # | 5 | 1500 |
#+tblfM: $3=$x*300
#+TBLFM: $3=$x*1

table cell with objects:

table cell's CONTENT can contain:
- minimal set of objects:
  - _plain text_
  - _text markup_
  - _entities_
  - _LaTeX fragments_
  - _superscripts_
  - _subscripts_
- citations, export snippets,
- footnote references
- links
- macros
- radio targets
- targets
- timestamps

  
  






| *bold*      | entity: \alpha | latex fragment $a_b$ | a_b | [[https://www.foo.bar][link]] | my radio target | <2025-08-02> | [[target]] |   |
  


